{
  "animals": [
    {
      "id": "clownfish",
      "name": { "zh": "小丑魚", "en": "Clownfish" },
      "habitatZone": "coralreef",
      "habitat": { "zh": "熱帶珊瑚礁海域，與海葵共生", "en": "Tropical coral reef waters, living in symbiosis with sea anemones" },
      "diet": { "zh": "雜食性", "en": "Omnivore" },
      "location": { "zh": "太平洋、印度洋的珊瑚礁區", "en": "Coral reefs of Pacific and Indian Oceans" },
      "size": { "zh": "身長約 7-15 公分", "en": "About 7-15 cm in length" },
      "description": { "zh": "小丑魚是最受歡迎的熱帶魚之一！牠們身上有鮮豔的橘色和白色條紋，非常好認。小丑魚最特別的地方是牠們會住在海葵裡面，海葵的觸手有毒，但小丑魚身上有特殊的黏液保護，所以不會被螫傷。小丑魚和海葵是好朋友，互相照顧對方喔！", "en": "Clownfish are one of the most popular tropical fish! They have bright orange and white stripes that make them easy to recognize. The special thing about clownfish is that they live inside sea anemones. The anemone's tentacles are poisonous, but clownfish have special mucus that protects them. Clownfish and anemones are best friends who take care of each other!" },
      "story": { "zh": "小丑魚尼尼今天很開心，因為海葵阿姨幫牠慶祝生日。尼尼住在海葵阿姨的觸手之間，每天都很安全。當一隻大魚游過來想吃尼尼時，海葵阿姨伸出觸手把大魚嚇跑了。尼尼說：「謝謝妳保護我！」海葵阿姨笑著說：「你也幫我趕走壞蟲蟲呀！」牠們是最好的朋友。", "en": "Nini the clownfish was happy today because Auntie Anemone threw a birthday party for her. Nini lives safely among Auntie Anemone's tentacles. When a big fish came to eat Nini, Auntie Anemone stretched out her tentacles and scared it away. Nini said, 'Thank you for protecting me!' Auntie Anemone smiled, 'You also chase away the bugs for me!' They are the best of friends." },
      "images": { "main": "/images/aquarium/clownfish/main.png", "story": [] }
    },
    {
      "id": "dolphin",
      "name": { "zh": "海豚", "en": "Dolphin" },
      "habitatZone": "saltwater",
      "habitat": { "zh": "溫暖和熱帶海域", "en": "Warm and tropical ocean waters" },
      "diet": { "zh": "肉食性", "en": "Carnivore" },
      "location": { "zh": "全球各大洋", "en": "All major oceans worldwide" },
      "size": { "zh": "身長約 2-4 公尺", "en": "About 2-4 meters in length" },
      "description": { "zh": "海豚是海洋中最聰明的動物之一！牠們喜歡成群結隊生活，會互相幫助和玩耍。海豚用超音波來「看」東西，這叫做回聲定位。牠們會發出咔噠聲，聲音碰到東西會彈回來，海豚就知道那裡有什麼了。海豚還會跳出水面玩耍，看起來總是笑咪咪的！", "en": "Dolphins are one of the smartest animals in the ocean! They love living in groups, helping each other and playing together. Dolphins use ultrasound to 'see' things, called echolocation. They make clicking sounds that bounce back from objects, telling them what's there. Dolphins also love jumping out of the water to play, always looking like they're smiling!" },
      "story": { "zh": "小海豚多多最喜歡和媽媽一起游泳。今天，多多學會了一個新技巧：跳出水面翻筋斗！多多試了好多次都失敗了，但媽媽一直鼓勵牠。終於，多多成功翻了一個漂亮的筋斗！所有的海豚朋友都為牠拍手（用尾巴拍水）。多多開心地說：「我做到了！」", "en": "Baby dolphin Duo loved swimming with mommy. Today, Duo learned a new trick: jumping out of the water and doing a flip! Duo tried many times and failed, but mommy kept encouraging. Finally, Duo did a beautiful flip! All the dolphin friends clapped for Duo by splashing their tails. Duo said happily, 'I did it!'" },
      "images": { "main": "/images/aquarium/dolphin/main.png", "story": [] }
    },
    {
      "id": "sea-turtle",
      "name": { "zh": "海龜", "en": "Sea Turtle" },
      "habitatZone": "saltwater",
      "habitat": { "zh": "熱帶和亞熱帶海域", "en": "Tropical and subtropical ocean waters" },
      "diet": { "zh": "雜食性", "en": "Omnivore" },
      "location": { "zh": "太平洋、大西洋、印度洋", "en": "Pacific, Atlantic, and Indian Oceans" },
      "size": { "zh": "身長約 60-180 公分", "en": "About 60-180 cm in length" },
      "description": { "zh": "海龜是活了很久很久的海洋動物！有些海龜可以活超過 100 歲呢。海龜媽媽會爬到沙灘上挖洞產卵，小海龜孵化後要自己爬回大海。海龜游泳的時候前腳像划槳一樣，游得又優雅又輕鬆。牠們喜歡吃海草和水母，是海洋的清潔工！", "en": "Sea turtles are ocean animals that live for a very long time! Some can live over 100 years. Mommy sea turtles crawl onto beaches to dig holes and lay eggs. Baby turtles must crawl back to the ocean by themselves after hatching. Sea turtles swim gracefully, using their front flippers like paddles. They love eating seagrass and jellyfish, like ocean cleaners!" },
      "story": { "zh": "小海龜慢慢剛從蛋裡孵出來，牠看著月光，知道大海就在那個方向。沙灘好長好長，慢慢的腳好小好小，但牠一步一步往前爬。螃蟹先生說：「加油！」海鷗阿姨說：「快到了！」終於，慢慢感受到海水的涼爽，牠成功回到大海的懷抱了！", "en": "Baby sea turtle Slowpoke just hatched from an egg. Looking at the moonlight, Slowpoke knew the ocean was that way. The beach was so long, and Slowpoke's flippers were so small, but step by step, forward. Mr. Crab said, 'You can do it!' Aunt Seagull said, 'Almost there!' Finally, Slowpoke felt the cool seawater and made it to the ocean's embrace!" },
      "images": { "main": "/images/aquarium/sea-turtle/main.png", "story": [] }
    },
    {
      "id": "jellyfish",
      "name": { "zh": "水母", "en": "Jellyfish" },
      "habitatZone": "saltwater",
      "habitat": { "zh": "全球各大洋域", "en": "All ocean waters worldwide" },
      "diet": { "zh": "肉食性", "en": "Carnivore" },
      "location": { "zh": "全球海洋", "en": "Oceans worldwide" },
      "size": { "zh": "直徑約 2-40 公分", "en": "About 2-40 cm in diameter" },
      "description": { "zh": "水母看起來像飄浮的果凍，透明又漂亮！牠們沒有腦袋、沒有心臟、沒有骨頭，身體有 95% 都是水。水母有長長的觸手，上面有小小的刺細胞，碰到會刺刺的。水母靠著收縮身體來游泳，像一把會動的雨傘。晚上有些水母還會發光呢！", "en": "Jellyfish look like floating jelly, transparent and beautiful! They have no brain, no heart, no bones - 95% of their body is water. Jellyfish have long tentacles with tiny stinging cells that can sting. They swim by squeezing their bodies, like a moving umbrella. Some jellyfish even glow at night!" },
      "story": { "zh": "小水母晶晶覺得自己不夠漂亮，因為牠是透明的。一天晚上，晶晶發現自己竟然會發光！其他小魚都圍過來說：「哇，好漂亮！」晶晶這才知道，原來自己是夜晚大海中最閃亮的星星。每個人都有自己特別的地方，只是要找到它而已。", "en": "Little jellyfish Crystal felt not pretty enough because she was transparent. One night, Crystal discovered she could glow! Other fish gathered around saying, 'Wow, so beautiful!' Crystal realized she was the brightest star in the nighttime sea. Everyone has something special about them - you just need to find it." },
      "images": { "main": "/images/aquarium/jellyfish/main.png", "story": [] }
    },
    {
      "id": "seahorse",
      "name": { "zh": "海馬", "en": "Seahorse" },
      "habitatZone": "coralreef",
      "habitat": { "zh": "淺海海草床和珊瑚礁", "en": "Shallow seagrass beds and coral reefs" },
      "diet": { "zh": "肉食性", "en": "Carnivore" },
      "location": { "zh": "熱帶和溫帶沿海水域", "en": "Tropical and temperate coastal waters" },
      "size": { "zh": "身長約 1.5-35 公分", "en": "About 1.5-35 cm in length" },
      "description": { "zh": "海馬是魚類中最特別的！牠們長得像小馬，用尾巴纏住海草固定自己。海馬游泳的時候是直立的，靠著背上的小鰭快速擺動。最特別的是，海馬爸爸會懷孕！媽媽把卵放進爸爸的育兒袋裡，爸爸負責照顧寶寶直到出生。", "en": "Seahorses are the most special fish! They look like tiny horses and use their tails to hold onto seagrass. Seahorses swim upright, quickly fluttering the small fin on their backs. The most special thing is that seahorse daddies get pregnant! Mommy puts eggs in daddy's pouch, and daddy takes care of the babies until they're born." },
      "story": { "zh": "海馬爸爸的肚子越來越大，因為裡面有好多小寶寶。海馬媽媽每天都來看爸爸，給他加油。終於有一天，一隻隻小海馬從爸爸的育兒袋裡游出來！牠們好小好可愛。爸爸雖然很累，但看著寶寶們，覺得一切都值得了。這就是愛的力量！", "en": "Seahorse daddy's tummy grew bigger because many babies were inside. Seahorse mommy visited every day to cheer him on. Finally, tiny seahorses swam out of daddy's pouch! They were so small and cute. Though tired, daddy looked at the babies and felt it was all worth it. That's the power of love!" },
      "images": { "main": "/images/aquarium/seahorse/main.png", "story": [] }
    },
    {
      "id": "octopus",
      "name": { "zh": "章魚", "en": "Octopus" },
      "habitatZone": "saltwater",
      "habitat": { "zh": "各種海洋環境，從淺水到深海", "en": "Various ocean environments, from shallow to deep waters" },
      "diet": { "zh": "肉食性", "en": "Carnivore" },
      "location": { "zh": "全球各大洋", "en": "All major oceans worldwide" },
      "size": { "zh": "身長約 30-90 公分（含腕足）", "en": "About 30-90 cm (including arms)" },
      "description": { "zh": "章魚有八隻腳，每隻腳上都有吸盤！牠們是海洋中最聰明的無脊椎動物，會開罐子、走迷宮。章魚可以變換顏色和紋路來偽裝，還能擠過很小的洞，因為牠們沒有骨頭。遇到危險時，章魚會噴出墨汁逃跑。", "en": "Octopuses have eight arms, each with suction cups! They're the smartest invertebrates in the ocean, able to open jars and solve mazes. Octopuses can change colors and patterns to camouflage, and squeeze through tiny holes since they have no bones. When in danger, they squirt ink to escape." },
      "story": { "zh": "小章魚八寶住在海底的貝殼洞裡。一天，一隻大螃蟹想搶八寶的家。八寶先是變成石頭的顏色躲起來，大螃蟹找不到牠。接著八寶噴出墨汁，趁機溜走找朋友幫忙。最後，八寶和朋友們一起把大螃蟹嚇跑了。團結就是力量！", "en": "Little octopus Eight lived in a shell cave on the seafloor. One day, a big crab wanted to steal Eight's home. Eight first changed to rock color to hide, and the crab couldn't find him. Then Eight squirted ink and slipped away to find friends. Together, they scared the crab away. Unity is strength!" },
      "images": { "main": "/images/aquarium/octopus/main.png", "story": [] }
    },
    {
      "id": "penguin",
      "name": { "zh": "企鵝", "en": "Penguin" },
      "habitatZone": "polar",
      "habitat": { "zh": "南極洲及周邊寒冷海域", "en": "Antarctica and surrounding cold waters" },
      "diet": { "zh": "肉食性", "en": "Carnivore" },
      "location": { "zh": "南半球，主要在南極洲", "en": "Southern Hemisphere, mainly Antarctica" },
      "size": { "zh": "身高約 40-120 公分", "en": "About 40-120 cm tall" },
      "description": { "zh": "企鵝是不會飛的鳥類，但牠們超會游泳！企鵝的翅膀變成了鰭狀肢，在水裡就像飛一樣快。企鵝住在很冷的地方，身上的羽毛和厚厚的脂肪可以保暖。企鵝爸爸媽媽會輪流照顧蛋和寶寶，是模範父母！", "en": "Penguins are birds that can't fly, but they're super swimmers! Their wings became flippers, swimming as fast as flying underwater. Penguins live in cold places, kept warm by their feathers and thick fat. Penguin parents take turns caring for eggs and babies - model parents!" },
      "story": { "zh": "企鵝寶寶皮皮還太小，不敢下水游泳。爸爸媽媽示範給牠看，但皮皮還是害怕。一天，皮皮看到朋友們都在水裡玩得很開心。牠鼓起勇氣，噗通一聲跳進水裡！原來游泳這麼好玩！皮皮學到：有時候要勇敢嘗試，才會發現新的快樂。", "en": "Baby penguin Pip was too small and scared to swim. Mom and Dad demonstrated, but Pip was still afraid. One day, Pip saw friends having fun in the water. Gathering courage, Pip jumped in with a splash! Swimming was so fun! Pip learned: sometimes you need to be brave to discover new happiness." },
      "images": { "main": "/images/aquarium/penguin/main.png", "story": [] }
    },
    {
      "id": "shark",
      "name": { "zh": "鯊魚", "en": "Shark" },
      "habitatZone": "saltwater",
      "habitat": { "zh": "全球各大洋，從淺水到深海", "en": "All oceans, from shallow to deep waters" },
      "diet": { "zh": "肉食性", "en": "Carnivore" },
      "location": { "zh": "全球海洋", "en": "Oceans worldwide" },
      "size": { "zh": "身長約 1-12 公尺（視種類而定）", "en": "About 1-12 meters (depending on species)" },
      "description": { "zh": "鯊魚是海洋中的頂級獵人！牠們有好幾排牙齒，掉了還會長新的。鯊魚的皮膚摸起來像砂紙，可以幫助牠們游得更快。雖然電影把鯊魚演得很可怕，但其實大部分鯊魚不會攻擊人類，牠們也是海洋生態的重要守護者。", "en": "Sharks are top predators of the ocean! They have several rows of teeth that grow back when lost. Shark skin feels like sandpaper and helps them swim faster. Though movies make sharks seem scary, most sharks don't attack humans. They're important guardians of ocean ecosystems." },
      "story": { "zh": "小鯊魚莎莎不喜歡自己的尖牙，覺得笑起來不好看。海龜奶奶告訴莎莎：「你的牙齒可以保護海洋的平衡呀！」莎莎開始認真巡邏海域，幫助維持生態。其他魚兒都很感謝莎莎。莎莎終於明白，每個人的特點都有它的用處。", "en": "Little shark Shasha didn't like her sharp teeth, thinking her smile looked bad. Grandma Sea Turtle said, 'Your teeth help protect the ocean's balance!' Shasha started patrolling the waters, helping maintain the ecosystem. Other fish were grateful. Shasha finally understood that everyone's features have their purpose." },
      "images": { "main": "/images/aquarium/shark/main.png", "story": [] }
    },
    {
      "id": "manta-ray",
      "name": { "zh": "鬼蝠魟", "en": "Manta Ray" },
      "habitatZone": "saltwater",
      "habitat": { "zh": "熱帶和亞熱帶海域", "en": "Tropical and subtropical waters" },
      "diet": { "zh": "濾食性", "en": "Filter feeder" },
      "location": { "zh": "太平洋、大西洋、印度洋", "en": "Pacific, Atlantic, and Indian Oceans" },
      "size": { "zh": "翼展約 3-7 公尺", "en": "About 3-7 meters wingspan" },
      "description": { "zh": "鬼蝠魟是海洋中最優雅的舞者！牠們有超大的翅膀狀胸鰭，游泳時就像在飛一樣。雖然名字聽起來可怕，但鬼蝠魟其實很溫和，牠們只吃浮游生物和小魚。鬼蝠魟很聰明，是少數會在鏡子前認出自己的海洋動物！", "en": "Manta rays are the most graceful dancers of the ocean! They have huge wing-like fins, swimming as if flying. Despite their scary name, manta rays are gentle, eating only plankton and small fish. Manta rays are smart - one of the few ocean animals that recognize themselves in mirrors!" },
      "story": { "zh": "鬼蝠魟曼曼覺得自己游得不夠優雅。老師鼓勵曼曼多練習。曼曼每天都在練習轉圈和滑翔。終於在海洋舞蹈大賽上，曼曼跳出了最美麗的舞！所有動物都為曼曼歡呼。曼曼學到：只要努力練習，就能讓夢想成真。", "en": "Manta ray Manny felt she didn't swim gracefully enough. Teacher encouraged practice. Manny practiced spinning and gliding every day. Finally, at the Ocean Dance Contest, Manny performed the most beautiful dance! All animals cheered. Manny learned: with practice, dreams come true." },
      "images": { "main": "/images/aquarium/manta-ray/main.png", "story": [] }
    },
    {
      "id": "angelfish",
      "name": { "zh": "神仙魚", "en": "Angelfish" },
      "habitatZone": "coralreef",
      "habitat": { "zh": "熱帶珊瑚礁海域", "en": "Tropical coral reef waters" },
      "diet": { "zh": "雜食性", "en": "Omnivore" },
      "location": { "zh": "大西洋、印度洋、太平洋的珊瑚礁", "en": "Coral reefs of Atlantic, Indian, and Pacific Oceans" },
      "size": { "zh": "身長約 15-45 公分", "en": "About 15-45 cm in length" },
      "description": { "zh": "神仙魚是珊瑚礁中最漂亮的魚之一！牠們身上有鮮豔的條紋和圖案，顏色有藍色、黃色、橘色等。神仙魚游泳的姿態優雅，扁扁的身體可以輕鬆穿梭在珊瑚之間。有趣的是，小神仙魚和大神仙魚的花紋完全不同呢！", "en": "Angelfish are among the prettiest fish in coral reefs! They have bright stripes and patterns in blues, yellows, and oranges. Angelfish swim gracefully, their flat bodies easily gliding between corals. Interestingly, baby angelfish have completely different patterns from adults!" },
      "story": { "zh": "小神仙魚天天不喜歡自己的條紋，因為和爸爸媽媽的不一樣。天天問媽媽：「為什麼我的花紋和你們不同？」媽媽笑著說：「等你長大，花紋就會變得和我們一樣漂亮喔！」天天每天照鏡子，終於有一天發現自己的花紋變了，變得更美了！", "en": "Little angelfish Tian didn't like her stripes because they were different from mom and dad's. Tian asked, 'Why are my patterns different from yours?' Mom smiled, 'When you grow up, your patterns will become beautiful like ours!' Tian looked in the mirror daily. One day, she found her patterns changed - even more beautiful!" },
      "images": { "main": "/images/aquarium/angelfish/main.png", "story": [] }
    },
    {
      "id": "sea-otter",
      "name": { "zh": "海獺", "en": "Sea Otter" },
      "habitatZone": "saltwater",
      "habitat": { "zh": "北太平洋沿岸冷水域", "en": "Cold waters along North Pacific coast" },
      "diet": { "zh": "肉食性", "en": "Carnivore" },
      "location": { "zh": "北太平洋沿岸，從阿拉斯加到加州", "en": "North Pacific coast, from Alaska to California" },
      "size": { "zh": "身長約 1-1.5 公尺", "en": "About 1-1.5 meters in length" },
      "description": { "zh": "海獺是超級可愛的海洋哺乳動物！牠們喜歡仰躺在水面上，還會用肚子當餐桌吃東西。海獺會用石頭敲開貝殼，是少數會使用工具的動物。牠們睡覺時會手牽手，這樣就不會漂走了。海獺的毛是所有動物中最密的！", "en": "Sea otters are super cute marine mammals! They love floating on their backs, using their tummies as tables to eat. Sea otters use rocks to crack shells - one of few tool-using animals. When sleeping, they hold hands so they don't drift apart. Sea otter fur is the densest of all animals!" },
      "story": { "zh": "小海獺毛毛學不會用石頭敲貝殼，每次都敲到自己的肚子。牠很沮喪，想放棄。媽媽告訴毛毛：「慢慢來，每隻海獺都是這樣學會的。」毛毛繼續練習，終於成功敲開了第一個貝殼！裡面的肉好好吃！毛毛開心地和媽媽手牽手睡覺了。", "en": "Baby sea otter Fluffy couldn't learn to crack shells with rocks, always hitting her tummy. Discouraged, she wanted to give up. Mom said, 'Take your time, every otter learns this way.' Fluffy kept practicing and finally cracked her first shell! The meat was delicious! Fluffy happily held hands with mom to sleep." },
      "images": { "main": "/images/aquarium/sea-otter/main.png", "story": [] }
    },
    {
      "id": "pufferfish",
      "name": { "zh": "河豚", "en": "Pufferfish" },
      "habitatZone": "saltwater",
      "habitat": { "zh": "熱帶和亞熱帶海域", "en": "Tropical and subtropical waters" },
      "diet": { "zh": "雜食性", "en": "Omnivore" },
      "location": { "zh": "太平洋、印度洋、大西洋", "en": "Pacific, Indian, and Atlantic Oceans" },
      "size": { "zh": "身長約 10-60 公分", "en": "About 10-60 cm in length" },
      "description": { "zh": "河豚是會變大的魚！當河豚害怕或生氣時，會吸進大量的水或空氣，把自己鼓成一個大球，讓敵人嚇一跳。河豚身上還有毒，所以很少動物敢吃牠們。有些河豚會在沙地上畫出美麗的圓形圖案來吸引異性，是海底的藝術家！", "en": "Pufferfish are fish that can grow bigger! When scared or angry, they gulp water or air to puff up like a big ball, surprising enemies. Pufferfish are also poisonous, so few animals dare eat them. Some pufferfish draw beautiful circular patterns in sand to attract mates - artists of the seafloor!" },
      "story": { "zh": "小河豚泡泡第一次遇到大魚，嚇得把自己鼓成大球。大魚被嚇跑了！泡泡發現自己的特殊能力其實很有用。回家後，泡泡告訴媽媽今天的冒險。媽媽說：「你做得很好！每個人都有保護自己的方式。」泡泡再也不覺得自己奇怪了。", "en": "Little pufferfish Bubble met a big fish for the first time and scared, puffed up into a big ball. The big fish ran away! Bubble discovered this special ability was useful. At home, Bubble told mom about the adventure. Mom said, 'Great job! Everyone has ways to protect themselves.' Bubble never felt weird again." },
      "images": { "main": "/images/aquarium/pufferfish/main.png", "story": [] }
    },
    {
      "id": "goldfish",
      "name": { "zh": "金魚", "en": "Goldfish" },
      "habitatZone": "freshwater",
      "habitat": { "zh": "淡水池塘、水族箱", "en": "Freshwater ponds, aquariums" },
      "diet": { "zh": "雜食性", "en": "Omnivore" },
      "location": { "zh": "原產於中國，現全球皆有飼養", "en": "Originally from China, now kept worldwide" },
      "size": { "zh": "身長約 10-30 公分", "en": "About 10-30 cm in length" },
      "description": { "zh": "金魚是最早被人類當寵物養的魚！牠們原本是灰色的鯽魚，經過很多年的培育，變成了漂亮的金色、紅色、白色。金魚有各種形狀的尾巴和眼睛，有的尾巴像裙子，有的眼睛凸凸的。金魚的記憶力其實比大家想的好很多喔！", "en": "Goldfish were the first fish kept as pets! Originally gray crucian carp, through many years of breeding, they became beautiful gold, red, and white. Goldfish have various tail and eye shapes - some tails like skirts, some eyes bulging. Goldfish actually have better memory than people think!" },
      "story": { "zh": "小金魚圓圓住在一個漂亮的魚缸裡。每天小主人都會來看圓圓，餵牠吃飯。圓圓很聰明，每次看到小主人的影子就會游到水面等飯吃。有一天，小主人生病了好幾天沒來。圓圓每天都在等，終於等到小主人來了！牠們都好開心。", "en": "Little goldfish Yuanyuan lived in a beautiful fish tank. Every day, the little owner came to see Yuanyuan and feed her. Smart Yuanyuan swam to the surface whenever she saw the owner's shadow. One day, the owner got sick and didn't come for days. Yuanyuan waited every day. Finally, the owner came back! They were both so happy." },
      "images": { "main": "/images/aquarium/goldfish/main.png", "story": [] }
    },
    {
      "id": "anglerfish",
      "name": { "zh": "鮟鱇魚", "en": "Anglerfish" },
      "habitatZone": "deepsea",
      "habitat": { "zh": "深海（200 公尺以下）", "en": "Deep sea (below 200 meters)" },
      "diet": { "zh": "肉食性", "en": "Carnivore" },
      "location": { "zh": "全球深海區域", "en": "Deep sea areas worldwide" },
      "size": { "zh": "身長約 20-100 公分", "en": "About 20-100 cm in length" },
      "description": { "zh": "鮟鱇魚住在深深的海底，那裡一片漆黑。牠們頭上有一根會發光的「釣竿」，用來吸引獵物。當小魚被光吸引過來，鮟鱇魚就一口把牠吃掉！鮟鱇魚長得雖然有點嚇人，但這是為了在黑暗的深海中生存的聰明設計。", "en": "Anglerfish live in the deep sea where it's pitch dark. They have a glowing 'fishing rod' on their heads to attract prey. When small fish are attracted by the light, anglerfish gulp them down! Though anglerfish look a bit scary, it's a clever design for surviving in the dark deep sea." },
      "story": { "zh": "小鮟鱇魚亮亮覺得深海好黑好孤單。但亮亮發現，牠頭上的小燈泡不只能抓食物，還能照亮周圍！亮亮用小燈泡找到了其他深海朋友：發光的水母、會閃的魷魚。原來深海也可以很熱鬧！亮亮不再覺得孤單了。", "en": "Little anglerfish Bright felt the deep sea was dark and lonely. But Bright discovered the little bulb on his head could not only catch food but also light up surroundings! Bright found other deep-sea friends: glowing jellyfish, flashing squid. The deep sea could be lively! Bright wasn't lonely anymore." },
      "images": { "main": "/images/aquarium/anglerfish/main.png", "story": [] }
    },
    {
      "id": "beluga-whale",
      "name": { "zh": "白鯨", "en": "Beluga Whale" },
      "habitatZone": "polar",
      "habitat": { "zh": "北極海域及周邊寒冷水域", "en": "Arctic waters and surrounding cold seas" },
      "diet": { "zh": "肉食性", "en": "Carnivore" },
      "location": { "zh": "北極海、白令海、聖勞倫斯灣", "en": "Arctic Ocean, Bering Sea, St. Lawrence Gulf" },
      "size": { "zh": "身長約 3-5.5 公尺", "en": "About 3-5.5 meters in length" },
      "description": { "zh": "白鯨全身雪白，被稱為「海中金絲雀」，因為牠們會發出各種叫聲！白鯨的頭很特別，圓圓的額頭可以改變形狀，幫助牠們發出和接收聲音。白鯨很友善，常常對人類露出「微笑」。牠們的皮膚冬天會變黃，脫皮後又變白！", "en": "Beluga whales are snow white, called 'sea canaries' because they make various sounds! Their heads are special - round foreheads can change shape to help send and receive sounds. Belugas are friendly, often 'smiling' at humans. Their skin turns yellow in winter and white again after shedding!" },
      "story": { "zh": "小白鯨貝貝住在冰冷的北極海。貝貝喜歡唱歌，但牠的歌聲和其他白鯨不太一樣。貝貝擔心別人不喜歡。有一天，一群海鳥聽到貝貝的歌，都飛來聽。原來貝貝的歌聲獨一無二，特別動聽！貝貝學到：做自己就是最棒的。", "en": "Baby beluga Beibei lived in the cold Arctic sea. Beibei loved singing, but her songs were different from other belugas. Beibei worried others wouldn't like it. One day, seabirds heard Beibei's song and flew over to listen. Beibei's voice was unique and beautiful! Beibei learned: being yourself is the best." },
      "images": { "main": "/images/aquarium/beluga-whale/main.png", "story": [] }
    }
  ]
}
